20231226051231-this_reference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-07 Sat 17:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>.this reference</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">.this reference</h1>
<p>
The reference <code>.this</code> can be used to distinguish the <b>fields</b> from the <b>localvariables</b>
</p>

<p>
The <code>.this</code> reference to the current object is useful in situations where a <code>local</code> variable <b>hides</b>, or <b>shadows</b>, a field with the same name.
i.e. `indicator` (2. field) or `location` (3. local variable) below.
</p>

<p>
If a member is not shadowed by a local declaration, the simple name member is considered a shorthand notation for this.member. (4)
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Light</span> {
  <span class="org-comment-delimiter">// </span><span class="org-comment">Fields:
</span>  <span class="org-type">int</span>     <span class="org-variable-name">noOfWatts</span>;      <span class="org-comment-delimiter">// </span><span class="org-comment">Wattage
</span>  <span class="org-type">boolean</span> <span class="org-variable-name">indicator</span>;      <span class="org-comment-delimiter">// </span><span class="org-comment">On or off
</span>  <span class="org-type">String</span>  <span class="org-variable-name">location</span>;       <span class="org-comment-delimiter">// </span><span class="org-comment">Placement
</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">Constructor:
</span>  <span class="org-keyword">public</span> Light(<span class="org-type">int</span> <span class="org-variable-name">noOfWatts</span>, <span class="org-type">boolean</span> <span class="org-variable-name">indicator</span>, String site) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">Local Variable
</span>    <span class="org-type">String</span> <span class="org-variable-name">location</span>;

    <span class="org-keyword">this</span>.noOfWatts = noOfWatts;   <span class="org-comment-delimiter">// </span><span class="org-comment">(1) Assignment to field
</span>    indicator = indicator;        <span class="org-comment-delimiter">// </span><span class="org-comment">(2) Incorrect Assignment to parameter
</span>    location = site;              <span class="org-comment-delimiter">// </span><span class="org-comment">(3) Incorrect Assignment to local variable
</span>    <span class="org-keyword">this</span>.superfluous();           <span class="org-comment-delimiter">// </span><span class="org-comment">(4)
</span>    superfluous();                <span class="org-comment-delimiter">// </span><span class="org-comment">equivalent to call at as it does not shadow a class member(4)
</span>  }

  <span class="org-comment-delimiter">// </span><span class="org-comment">Instance method:
</span>  <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">superfluous</span>() {
    System.out.printf(<span class="org-string">"Current object: %s%n"</span>, <span class="org-keyword">this</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">(5)
</span>  }

  <span class="org-comment-delimiter">// </span><span class="org-comment">Static method:
</span>  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-type">Light</span> <span class="org-variable-name">light</span> = <span class="org-keyword">new</span> <span class="org-type">Light</span>(100, <span class="org-constant">true</span>, <span class="org-string">"loft"</span>);
    System.out.println(<span class="org-string">"No. of watts: "</span> + light.noOfWatts); <span class="org-comment-delimiter">// </span><span class="org-comment">Prints 100
</span>    System.out.println(<span class="org-string">"Indicator:    "</span> + light.indicator); <span class="org-comment-delimiter">// </span><span class="org-comment">Prints false
</span>    System.out.println(<span class="org-string">"Location:     "</span> + light.location); <span class="org-comment-delimiter">// </span><span class="org-comment">Prints null
</span>  }
}
<span class="org-comment-delimiter">/*</span><span class="org-comment">
    Output:
    Current object: Light@1bc4459
    Current object: Light@1bc4459
    No. of watts: 100
    Indicator: false
    Location: null
</span><span class="org-comment-delimiter">*/</span>
</pre>
</div>
</div>
</body>
</html>
